# -------------------------------------------------------------------------------------------------------
# задача 1 -  розрахунок площі та периметру прямокутника
a = 10 # сторона 1
b = 20 # сторона 2
S = a*b
P = (a+b)*2
print('')
print('Задача 1')
print('Площа прямокутника',S)
print('Периметр прямокутника',P)
# -------------------------------------------------------------------------------------------------------
# задача 2 -  розрахунок площі поверхні та об'єму паралелепіпеда
a = 10 # сторона 1
b = 20 # сторона 2
c = 30 # сторона 3
S = 2*(a*b + b*c + a*c)
V = (a*b*c)
print('')
print('Задача 2')
print('Площа паралелепіпеда',S)
print('Обєм паралелепіпеда',V)
# -------------------------------------------------------------------------------------------------------
# задача 3 -  розрахунок площі прямокутного трикутника
a = 3 # сторона 1
b = 4 # сторона 2
c = 5 # сторона 3
S = a*b/2
print('')
print('Задача 3')
print('Площа прямокутного трикутника',S)
# -------------------------------------------------------------------------------------------------------
# задача 4 -  розрахунок обєму куба
a = 3 # сторона 1
V = a**3
print('')
print('Задача 4')
print('Обєм куба',V)

