# -------------------------------------------------------------------------------------------------------
def task_1():
    print('task 1')
    print(56/8 - 5)
    print()
    return
# -------------------------------------------------------------------------------------------------------
def task_2():
    print('task 2')
    print(125/25 + 10)
    print(2*3*4*5/6)
    print(765/9 + 48*4 - 121)
    print('')
    return
# -------------------------------------------------------------------------------------------------------
def task_3():
    print('task 3')
    print('Привіт!')
    print('Як тебе звати?')
    name = input('Введи своє ім\'я\n')
    print('Радий тебе вітати, ', name)
    print('')
    return
# -------------------------------------------------------------------------------------------------------
def task_4():
    print('task 4')
    print('-Привіт!')
    print('-Як тебе звати?')
    print('-Kубик')
    print('-Радий тебе вітати, Kубик')
    print('-Як твоє прізвище?')
    print('-Рубик')
    print('-Будьмо знайомі, Кубик Рубик.')
    print('')
    return
# -------------------------------------------------------------------------------------------------------
def task_5():
    print('task 5')
    mno = input('Введіть назву оператора мобільного зв’язку\n')
    cell = input('Введіть номер телефону для поповнення рахунку\n')
    value = input('Вкажіть суму поповнення рахунку\n')
    print('Шановний абоненте ',mno,
          '! Ви поповнюєте телефон за номером',cell,
          'на суму ',value,' грн.')
    return
# -------------------------------------------------------------------------------------------------------
if __name__ == '__main__':
    task_1()
    task_2()
    task_3()
    task_4()
    task_5()

